InformationRegisters/БелыйСписокНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>БелыйСписокНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЧерныйСписокНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЧерныйСписокНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БелыйСписокНоменклатуры/Ext/ManagerModule.bsl
Функция ПолучитьВхождениеНоменклатуры(Номенклатура, Ресторан = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьВхождениеНоменклатуры(Номенклатура, Ресторан, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьВхождениеНоменклатуры()


Функция ПолучитьСписокНоменклатуры(Ресторан = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьСписокНоменклатуры(Ресторан, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьСписокНоменклатуры()

Процедура ОчиститьСписокНоменклатуры(Ресторан = Неопределено, Полностью = Ложь) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.ОчиститьСписокНоменклатуры(Ресторан, Полностью, "БелыйСписокНоменклатуры");
	
КонецПроцедуры // ОчиститьИсториюНоменклатуры()


Функция ПолучитьКоличествоНоменклатуры(Ресторан = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьКоличествоНоменклатуры(Ресторан, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьКоличествоНоменклатуры()


Функция ПолучитьТаблицуВхожденийНоменклатуры(Номенклатура) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьТаблицуВхожденийНоменклатуры(Номенклатура, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьТаблицуВхожденийНоменклатуры()

Процедура УстановитьТаблицуВхожденийНоменклатуры(Номенклатура, ТаблицаВхождений) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.УстановитьТаблицуВхожденийНоменклатуры(Номенклатура, ТаблицаВхождений, "БелыйСписокНоменклатуры");
	
КонецПроцедуры // УстановитьТаблицуВхожденийНоменклатуры()


Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если (ВидФормы = "ФормаЗаписи") Тогда
		Если ПолучитьПараметрыУчета().БелыйСписокНоменклатурыУчетКоличества И (Не Справочники.Рестораны.КоличествоАктуальныхРесторановБолееОдного()) Тогда
			ВыбраннаяФорма = "ФормаУпрощенная"; СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПолученияФормы()

//Костенюк Александр-Старт 28.05.2012
//
// Процедура добавляет позицию в регистр, либо изменяет количество для позиции
//
// Параметры
// Номенклатура - Тип: СправочникСсылка.Номенклатура, позиция, которую необходимо добавить либо изменить количество
// Ресторан - Тип: СправочникСсылка.Рестораны, ресторан, для которого нужно добавить позицию
// Регистр - Тип: Строка, Регистр, в который будет добавлена запись(либо изменена)
//
Процедура УстановитьПозицию(Номенклатура, Количество, Ресторан, Регистр) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.УстановитьПозицию(Номенклатура, Количество, Ресторан, Регистр);
	
КонецПроцедуры
//Костенюк Александр-Финиш 28.05.2012

//Костенюк Александр-Старт 28.05.2012
//
// Процедура удаляет позицию из списка
//
// Параметры
// Номенклатура - Тип: СправочникСсылка.Номенклатура, позиция, которую необходимо удалить
// Ресторан - Тип: СправочникСсылка.Рестораны, ресторан, для которого нужно удалить позицию
// Регистр - Тип: Строка, Регистр, из которого будет произведено удаление позиции
//
Процедура УдалитьПозицию(Номенклатура, Ресторан, Регистр) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.УдалитьПозицию(Номенклатура, Ресторан, Регистр);
	
КонецПроцедуры
//Костенюк Александр-Финиш 28.05.2012
